# LEETCODE
## Problem-1068: Product Sales Analysis I

Class: Easy

Source: https://leetcode.com/problems/product-sales-analysis-i/

## Description
Table: Sales
| Column Name | Type  |
|-------------|-------|
| sale_id     | int   |
| product_id  | int   |
| year        | int   |
| quantity    | int   |
| price       | int   |

(sale_id, year) is the primary key of this table.
product_id is a foreign key to Product table.
Each row of this table shows a sale on the product product_id in a certain year.
Note that the price is per unit.

 

Table: Product
| Column Name  | Type    |
|--------------|---------|
| product_id   | int     |
| product_name | varchar |

product_id is the primary key of this table.
Each row of this table indicates the product name of each product.
 
## To Do
Write an SQL query that reports the product_name, year, and price for each sale_id in the Sales table.

Return the resulting table in any order.

The query result format is in the following example.

## Example
Input: 
Sales table:
| sale_id | product_id | year | quantity | price |
|---------|------------|------|----------|-------| 
| 1       | 100        | 2008 | 10       | 5000  |
| 2       | 100        | 2009 | 12       | 5000  |
| 7       | 200        | 2011 | 15       | 9000  |

Product table:
| product_id | product_name |
|------------|--------------|
| 100        | Nokia        |
| 200        | Apple        |
| 300        | Samsung      |

Output: 
| product_name | year  | price |
|--------------|-------|-------|
| Nokia        | 2008  | 5000  |
| Nokia        | 2009  | 5000  |
| Apple        | 2011  | 9000  |

Explanation: 
From sale_id = 1, we can conclude that Nokia was sold for 5000 in the year 2008.
From sale_id = 2, we can conclude that Nokia was sold for 5000 in the year 2009.
From sale_id = 7, we can conclude that Apple was sold for 9000 in the year 2011.

## Importing

In [1]:
import pandas as pd
from pandasql import sqldf

## Define Schema

In [2]:
data = {
    'sale_id': [1, 2, 3],
    'product_id': [101, 102, 103],
    'year': [2022, 2023, 2022],
    'quantity': [10, 5, 8],
    'price': [50, 100, 75]
}

Sales = pd.DataFrame(data)

data = {
    'product_id': [101, 102, 103],
    'product_name': ['Product A', 'Product B', 'Product C']
}

Product = pd.DataFrame(data)

In [3]:
Sales

   sale_id  product_id  year  quantity  price
0        1         101  2022        10     50
1        2         102  2023         5    100
2        3         103  2022         8     75

In [4]:
Product

   product_id product_name
0         101    Product A
1         102    Product B
2         103    Product C

## Task

In [6]:
# Define the SQL query
query = """
SELECT product_name, year, price
FROM Sales
LEFT JOIN Product USING (product_id)
;
"""

# Excute the query using pandasql
result = sqldf(query, env={'Sales':Sales, 'Product':Product})

# Dipslay the results dataframe
display(result)

  product_name  year  price
0    Product A  2022     50
1    Product B  2023    100
2    Product C  2022     75